<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introducci칩n" data-toc-modified-id="Introducci칩n-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introducci칩n</a></span></li><li><span><a href="#Instalaci칩n" data-toc-modified-id="Instalaci칩n-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Instalaci칩n</a></span></li><li><span><a href="#Introducci칩n-a-las-estructuras-de-datos-de-pandas" data-toc-modified-id="Introducci칩n-a-las-estructuras-de-datos-de-pandas-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introducci칩n a las estructuras de datos de pandas</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li></ul></li><li><span><a href="#Datos-de-lectura/escritura" data-toc-modified-id="Datos-de-lectura/escritura-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Datos de lectura/escritura</a></span><ul class="toc-item"><li><span><a href="#Cargamos-datos-en-formato-CSV" data-toc-modified-id="Cargamos-datos-en-formato-CSV-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Cargamos datos en formato CSV</a></span></li><li><span><a href="#Visualizamos-las-primeras-filas" data-toc-modified-id="Visualizamos-las-primeras-filas-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Visualizamos las primeras filas</a></span></li><li><span><a href="#Visualizamos-las-칰ltimas-filas" data-toc-modified-id="Visualizamos-las-칰ltimas-filas-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Visualizamos las 칰ltimas filas</a></span></li><li><span><a href="#Visualizamos-una-muestra-aleatoria" data-toc-modified-id="Visualizamos-una-muestra-aleatoria-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Visualizamos una muestra aleatoria</a></span></li></ul></li><li><span><a href="#Operaciones-b치sicas-con-los-dataframes" data-toc-modified-id="Operaciones-b치sicas-con-los-dataframes-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Operaciones b치sicas con los dataframes</a></span><ul class="toc-item"><li><span><a href="#Seleccionamos-una-columna" data-toc-modified-id="Seleccionamos-una-columna-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Seleccionamos una columna</a></span></li><li><span><a href="#Seleccionamos-varias-columnas" data-toc-modified-id="Seleccionamos-varias-columnas-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Seleccionamos varias columnas</a></span></li><li><span><a href="#Obtener-los-valores-칰nicos-de-una-columna-(es-decir,-una-serie)" data-toc-modified-id="Obtener-los-valores-칰nicos-de-una-columna-(es-decir,-una-serie)-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Obtener los valores 칰nicos de una columna (es decir, una serie)</a></span></li><li><span><a href="#Filtramos-los-datos-por-el-valor-de-las-columnas" data-toc-modified-id="Filtramos-los-datos-por-el-valor-de-las-columnas-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span>Filtramos los datos por el valor de las columnas</a></span></li><li><span><a href="#Copia-de-un-dataframe-y-renombrar-columnas" data-toc-modified-id="Copia-de-un-dataframe-y-renombrar-columnas-5.5"><span class="toc-item-num">5.5&nbsp;&nbsp;</span>Copia de un dataframe y renombrar columnas</a></span><ul class="toc-item"><li><span><a href="#Podemos-renombrar-las-columnas-machacando-el-atributo-de-la-instancia...-쯢s-suena-esto?" data-toc-modified-id="Podemos-renombrar-las-columnas-machacando-el-atributo-de-la-instancia...-쯢s-suena-esto?-5.5.1"><span class="toc-item-num">5.5.1&nbsp;&nbsp;</span>Podemos renombrar las columnas machacando el atributo de la instancia... 쯢s suena esto?</a></span></li></ul></li><li><span><a href="#Borramos-columnas" data-toc-modified-id="Borramos-columnas-5.6"><span class="toc-item-num">5.6&nbsp;&nbsp;</span>Borramos columnas</a></span></li><li><span><a href="#Borramos-filas" data-toc-modified-id="Borramos-filas-5.7"><span class="toc-item-num">5.7&nbsp;&nbsp;</span>Borramos filas</a></span></li><li><span><a href="#Reset_index-y-set_index" data-toc-modified-id="Reset_index-y-set_index-5.8"><span class="toc-item-num">5.8&nbsp;&nbsp;</span>Reset_index y set_index</a></span><ul class="toc-item"><li><span><a href="#SET_INDEX" data-toc-modified-id="SET_INDEX-5.8.1"><span class="toc-item-num">5.8.1&nbsp;&nbsp;</span>SET_INDEX</a></span></li></ul></li><li><span><a href="#Operaciones-entre-columnas" data-toc-modified-id="Operaciones-entre-columnas-5.9"><span class="toc-item-num">5.9&nbsp;&nbsp;</span>Operaciones entre columnas</a></span></li></ul></li><li><span><a href="#Apply-!!" data-toc-modified-id="Apply-!!-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Apply !!</a></span></li><li><span><a href="#Df-.loc-e-.iloc" data-toc-modified-id="Df-.loc-e-.iloc-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Df .loc e .iloc</a></span><ul class="toc-item"><li><span><a href="#Seleccionar-filas-y-columnas-en-Pandas-mediante-posici칩n-con-iloc" data-toc-modified-id="Seleccionar-filas-y-columnas-en-Pandas-mediante-posici칩n-con-iloc-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Seleccionar filas y columnas en Pandas mediante posici칩n con iloc</a></span></li><li><span><a href="#Seleccionar-filas-y-columnas-en-Pandas-en-base-a-etiquetas-con-loc" data-toc-modified-id="Seleccionar-filas-y-columnas-en-Pandas-en-base-a-etiquetas-con-loc-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Seleccionar filas y columnas en Pandas en base a etiquetas con loc</a></span><ul class="toc-item"><li><span><a href="#En-base-a-etiqueta" data-toc-modified-id="En-base-a-etiqueta-7.2.1"><span class="toc-item-num">7.2.1&nbsp;&nbsp;</span>En base a etiqueta</a></span></li><li><span><a href="#En-base-a-una-condici칩n" data-toc-modified-id="En-base-a-una-condici칩n-7.2.2"><span class="toc-item-num">7.2.2&nbsp;&nbsp;</span>En base a una condici칩n</a></span></li></ul></li></ul></li><li><span><a href="#An치lisis-exploratorio-de-un-dataframe" data-toc-modified-id="An치lisis-exploratorio-de-un-dataframe-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>An치lisis exploratorio de un dataframe</a></span><ul class="toc-item"><li><span><a href="#Buscamos-valores-nulos" data-toc-modified-id="Buscamos-valores-nulos-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Buscamos valores nulos</a></span></li><li><span><a href="#Borramos-los-valores-nulos" data-toc-modified-id="Borramos-los-valores-nulos-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Borramos los valores nulos</a></span></li><li><span><a href="#C칩mo-rellenar-los-datos-que-faltan" data-toc-modified-id="C칩mo-rellenar-los-datos-que-faltan-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span>C칩mo rellenar los datos que faltan</a></span></li></ul></li><li><span><a href="#Agregaci칩n-de-datos" data-toc-modified-id="Agregaci칩n-de-datos-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Agregaci칩n de datos</a></span></li><li><span><a href="#Spoiler-fantasioso-de-ma침ana" data-toc-modified-id="Spoiler-fantasioso-de-ma침ana-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Spoiler fantasioso de ma침ana</a></span></li><li><span><a href="#Summaary" data-toc-modified-id="Summaary-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Summaary</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

#Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

Mi gif favorito para la que, a partir de ahora, ser치 tu librer칤a favorita 游땘

##Introducci칩n 
Pandas es, sin duda, la biblioteca m치s utilizada en el ecosistema de Python para el an치lisis y la manipulaci칩n de datos. Es r치pida, potente, flexible, f치cil de usar y de c칩digo abierto. 


Entre sus principales caracter칤sticas est치n
* Un objeto **DataFrame** r치pido y eficiente para la manipulaci칩n de datos con indexaci칩n integrada
* **Lectura y escritura** de datos en multitud de formatos: Microsoflt Excel, CSV, bases de datos SQL, etc;
* M칠todos integrados y eficientes para todo tipo de manipulaci칩n de datos: datos faltantes, subconjunto, uni칩n, fusi칩n, etc; 
* Facilidad para trabajar con datos temporales (de hecho, Pandas se llama as칤 por "PANnel DAta") 
* Buena **integraci칩n con otras librer칤as** de an치lisis de datos o Machine learning: scikit-learn, scipy, seaborn, plotly, etc;
* Es **ampliamente utilizado** tanto en el sector privado como en el acad칠mico     


Pandas proporciona estructuras de datos de alto nivel y funciones dise침adas para hacer que el trabajo con datos estructurados o tabulares sea r치pido, f치cil y expresivo. Desde su aparici칩n en 2010, ha ayudado a que Python sea un entorno de an치lisis de datos potente y productivo. Los principales objetos de pandas que se utilizar치n en este libro son el DataFrame, una estructura de datos tabular orientada a columnas con etiquetas de filas y columnas, y la Serie, un objeto de matriz unidimensional etiquetado.

Pandas combina las ideas de alto rendimiento de NumPy con las capacidades flexibles de manipulaci칩n de datos de las hojas de c치lculo y las bases de datos relacionales (como SQL). Proporciona una sofisticada funcionalidad de indexaci칩n para facilitar la remodelaci칩n, el corte y la divisi칩n, la realizaci칩n de agregaciones y la selecci칩n de subconjuntos de datos.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Fuente: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

##Instalaci칩n

Lo primerito que deber치s hacer, siempre ser치     
pip install pandas

In [188]:
import pandas as pd

## Introducci칩n a las estructuras de datos de pandas
Para empezar con pandas, necesitar치s sentirte c칩modo con sus dos estructuras de datos de trabajo: Series y DataFrame. Aunque no son una soluci칩n universal para todos los problemas, proporcionan una base s칩lida y f치cil de usar para la mayor칤a de las aplicaciones.

### Series
Una Serie es un objeto tipo array unidimensional que contiene una secuencia de valores (de tipos similares a los de NumPy) y un array asociado de etiquetas de datos, llamado su 칤ndice. La Serie m치s sencilla se forma a partir de un 칰nico array de datos:

In [189]:
serie = pd.Series([1,2,3,4,6,78,89,54,356,787,65])
serie

0       1
1       2
2       3
3       4
4       6
5      78
6      89
7      54
8     356
9     787
10     65
dtype: int64

La representaci칩n en cadena de una Serie mostrada interactivamente muestra el 칤ndice a la izquierda y los valores a la derecha. Como no especificamos un 칤ndice para los datos, se crea uno por defecto formado por los enteros 0 a N - 1 (donde N es la longitud de los datos). Puedes obtener la representaci칩n del array y el objeto 칤ndice de la Serie a trav칠s de sus atributos values e index, respectivamente:

In [190]:
serie.values

array([  1,   2,   3,   4,   6,  78,  89,  54, 356, 787,  65])

In [191]:
serie.index

RangeIndex(start=0, stop=11, step=1)

Otra forma de pensar en una Serie es como un dict ordenado de longitud fija, ya que es un mapeo de valores de 칤ndice a valores de datos. Se puede utilizar en muchos contextos en los que se podr칤a utilizar un diccionario.
Si tienes datos contenidos en un dict de Python, puedes crear una Serie a partir de ellos pasando el dict:

In [192]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
serie2 = pd.Series(sdata)
serie2

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

Cuando s칩lo se pasa un dict, el 칤ndice de la Serie resultante tendr치 las claves del dict en orden. Puedes anular esto pasando las claves del dict en el orden que desee que aparezcan en la Serie resultante:

In [193]:
estados = ['California', 'Ohio', 'Oregon', 'Texas']
serie3 = pd.Series(sdata,index = estados)
serie3

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [194]:
serie3.index

Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object')

Aqu칤, los tres valores encontrados en sdata se colocaron en los lugares apropiados, pero como no se encontr칩 ning칰n valor para 'California', aparece como NaN (no es un n칰mero), lo que se considera en pandas para marcar valores perdidos o NA. Como "Utah" no se incluy칩 en los estados, se excluye del objeto resultante.

In [195]:
# Buscar valores NA

In [196]:
pd.isnull(serie3)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

## Datos de lectura/escritura

Pandas puede leer y escribir datos de una gran variedad de formatos. [Lee la documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Aunque una de las m치s comunes es a partir de un dictado de listas de igual longitud o arrays NumPy:

In [197]:
# Desde un diccionario
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [198]:
#Desde una lista de diccionarios
datos = [{'nombre': 'Fer',
               'apellido': 'Costa',
               'email': 'fer.costa@ironhack.com',
               'vacaciones': 30,
               'saludo': lambda : print('Holi, soy Fer, hacedme lo primerito la Pull Request')}, 
         
         {'nombre': 'Ana',
               'apellido': 'Garc칤a',
                  'email': 'ana.garcia@ironhack.com',
               'vacaciones': 30,
               'saludo': lambda : print('Hola, soy Ana, cuidado con los print infinitos') }]
len(datos)

2

In [199]:
data = pd.DataFrame(datos)
data

,nombre,apellido,email,vacaciones,saludo
0,Fer,Costa,fer.costa@ironhack.com,30,<function <lambda> at 0x7fec8c587040>
1,Ana,Garc칤a,ana.garcia@ironhack.com,30,<function <lambda> at 0x7fec8c5870d0>

In [200]:
print(data)

  nombre apellido                    email  vacaciones  \
0    Fer    Costa   fer.costa@ironhack.com          30
1    Ana   Garc칤a  ana.garcia@ironhack.com          30

                                  saludo
0  <function <lambda> at 0x7fec8c587040>
1  <function <lambda> at 0x7fec8c5870d0>

In [201]:
display(data)

,nombre,apellido,email,vacaciones,saludo
0,Fer,Costa,fer.costa@ironhack.com,30,<function <lambda> at 0x7fec8c587040>
1,Ana,Garc칤a,ana.garcia@ironhack.com,30,<function <lambda> at 0x7fec8c5870d0>

Como estamos usando Jupyter Notebook, los objetos DataFrame de pandas se mostrar치n como una tabla HTML m치s amigable para el navegador.

###Cargamos datos en formato CSV

In [202]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")
df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

###Visualizamos las primeras filas

In [203]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

Por defecto head me muestra las 5 primeras filas, puedo ver algunas m치s o algunas menos pas치ndole un n칰mero como par치metro

In [204]:
df.head(3)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany

###Visualizamos las 칰ltimas filas

In [205]:
df.tail()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

Excatamente igual que con .head() le pasamos un par치metro a .tail()

In [206]:
df.tail(3)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

### Visualizamos una muestra aleatoria

In [207]:
 #si no le pasamos un par치metro, visualiza una sola fila de forma aleatoria.

In [208]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
17010,43,2017-03-05,2.92,21218.15,8013.98,10054.06,0.0,3150.11,3150.11,0.0,0.0,organic,2017,SanFrancisco

In [209]:
df.sample(3)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
13276,43,2016-02-28,1.58,60098.19,2835.20,36495.81,1921.79,18845.39,11789.84,7055.55,0.00,organic,2016,Midsouth
6035,48,2017-01-29,1.33,213609.12,48872.88,86135.67,9146.99,69453.58,58828.73,9630.41,994.44,conventional,2017,Charlotte
15415,38,2017-04-09,0.89,65820.33,11793.22,2019.38,76.45,51931.28,47908.39,4022.89,0.00,organic,2017,Denver

##Operaciones b치sicas con los dataframes

###Seleccionamos una columna

In [210]:
columna_type = df.type

In [211]:
columna_type

0        conventional
1        conventional
2        conventional
3        conventional
4        conventional
             ...
18244         organic
18245         organic
18246         organic
18247         organic
18248         organic
Name: type, Length: 18249, dtype: object

In [212]:
type(columna_type)

pandas.core.series.Series

In [213]:
df["Total Bags"]

0         8696.87
1         9505.56
2         8145.35
3         5811.16
4         6183.95
           ...
18244    13498.67
18245     9264.84
18246     9394.11
18247    10969.54
18248    12014.15
Name: Total Bags, Length: 18249, dtype: float64

In [214]:
#O dos :), o las que queramos

In [215]:
reducido = df[["Date","year"]]
reducido

             Date  year
0      2015-12-27  2015
1      2015-12-20  2015
2      2015-12-13  2015
3      2015-12-06  2015
4      2015-11-29  2015
...           ...   ...
18244  2018-02-04  2018
18245  2018-01-28  2018
18246  2018-01-21  2018
18247  2018-01-14  2018
18248  2018-01-07  2018

[18249 rows x 2 columns]

###Seleccionamos varias columnas

In [216]:
columnas = ['Date', 'AveragePrice', 'Total Volume']

In [217]:
#le podemos pasar directamente una lista con los nombres de las columnas
reducido2 = df[columnas]
reducido2

             Date  AveragePrice  Total Volume
0      2015-12-27          1.33      64236.62
1      2015-12-20          1.35      54876.98
2      2015-12-13          0.93     118220.22
3      2015-12-06          1.08      78992.15
4      2015-11-29          1.28      51039.60
...           ...           ...           ...
18244  2018-02-04          1.63      17074.83
18245  2018-01-28          1.71      13888.04
18246  2018-01-21          1.87      13766.76
18247  2018-01-14          1.93      16205.22
18248  2018-01-07          1.62      17489.58

[18249 rows x 3 columns]

In [218]:
# Listar los nombres de columnas de un dataframe

In [219]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [220]:
columnas_data = list(df.columns)
print(columnas_data)

['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225', '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year', 'region']

### Obtener los valores 칰nicos de una columna (es decir, una serie)

In [221]:
df.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [222]:
df["type"].unique()

array(['conventional', 'organic'], dtype=object)

###Filtramos los datos por el valor de las columnas

In [223]:
df2 = df[df["region"] == "Houston"]
df2.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
936,0,2015-12-27,0.78,944506.54,389773.22,288003.62,126150.81,140578.89,73711.94,36493.62,30373.33,conventional,2015,Houston
937,1,2015-12-20,0.75,922355.67,382444.22,278067.11,127372.19,134472.15,72198.16,31520.66,30753.33,conventional,2015,Houston
938,2,2015-12-13,0.73,998752.95,412187.80,386865.21,81450.04,118249.90,69011.01,48622.22,616.67,conventional,2015,Houston
939,3,2015-12-06,0.74,989676.85,368528.91,490805.00,7041.19,123301.75,61020.31,62281.44,0.00,conventional,2015,Houston
940,4,2015-11-29,0.79,783225.98,391616.95,289533.68,4334.89,97740.46,67880.28,29860.18,0.00,conventional,2015,Houston

In [224]:
df2 = df[df.region != "Houston"]
df2.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

###Copia de un dataframe y renombrar columnas

In [225]:
df_copia = df.copy()
df_copia.head(1)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany

In [226]:
df_copia.rename(columns = {"Unnamed: 0": "unnamed", "Total Bags": "total_bags", "Small Bags": "small_bags", "Total Volume": "total_volume", "Large Bags": "large_bags","XLarge Bags":"xlarge_bags" })

,unnamed,Date,AveragePrice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [227]:
diccio_columnas = {"Unnamed: 0": "unnamed", "Total Bags": "total_bags", "Small Bags": "small_bags", "Total Volume": "total_volume", "Large Bags": "large_bags","XLarge Bags":"xlarge_bags" }

In [228]:
#Utilizamos el inplace=True para que se ejecute la acci칩n sobre el dataframe
df.rename(columns=diccio_columnas, inplace = True)

In [229]:
# Podr칤amos guardarlo en una nueva variable
data = df.rename(columns = diccio_columnas)
data.head()

,unnamed,Date,AveragePrice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [230]:
#O podr칤amos machacar la variable df 
df = df.rename(columns = diccio_columnas)
df.head()

,unnamed,Date,AveragePrice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

####Podemos renombrar las columnas machacando el atributo de la instancia... 쯢s suena esto?

In [231]:
columnas = list(df.columns)
columnas

['unnamed',
 'Date',
 'AveragePrice',
 'total_volume',
 '4046',
 '4225',
 '4770',
 'total_bags',
 'small_bags',
 'large_bags',
 'xlarge_bags',
 'type',
 'year',
 'region']

In [232]:
columnas_mayus = [str(columna).upper() for columna in columnas]

In [233]:
df.columns = columnas_mayus

In [234]:
df.head(2)

,UNNAMED,DATE,AVERAGEPRICE,TOTAL_VOLUME,4046,4225,4770,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany

### Borramos columnas

In [235]:
df = df.drop(['4046','4225','4770',"UNNAMED"], axis = 1) # Axis 1 siempre columnas

In [236]:
df.head()

,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,2015-12-27,1.33,64236.62,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,2015-12-20,1.35,54876.98,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2015-12-13,0.93,118220.22,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

### Borramos filas

In [237]:
df.drop([0,1,2], axis = 0, inplace= True)

In [238]:
df.head()

,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
3,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
5,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
6,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
7,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany

Las filas tambi칠n se pueden eliminar. Ten en cuenta que los 칤ndices no se reinician. El 칤ndice se asocia a la fila, no a la orden.   
쯉e puede reiniciar el index? Correcto

###Reset_index y set_index

Leemos la [documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) para entender algunos par치metros

In [239]:
#Drop = True evita que se genere otra columna con el index anterior
df = df.reset_index()
df.head()

,index,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,3,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
1,4,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
2,5,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
3,6,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
4,7,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany

In [240]:
df.reset_index(drop=True, inplace=False)

,index,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,3,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
1,4,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
2,5,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
3,6,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
4,7,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...
18241,18244,2018-02-04,1.63,17074.83,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18242,18245,2018-01-28,1.71,13888.04,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18243,18246,2018-01-21,1.87,13766.76,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18244,18247,2018-01-14,1.93,16205.22,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18245,18248,2018-01-07,1.62,17489.58,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [241]:
df.drop("index", axis = 1, inplace=True)

In [242]:
df.head()

,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
0,2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
1,2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
2,2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
3,2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
4,2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany

#### SET_INDEX

In [243]:
df = df.set_index("DATE")
df.head()

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION
DATE,,,,,,,,,
2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany

###Operaciones entre columnas

In [244]:
# Para generar una columna nueva solo tengo que ponerle un nombre

df["nueva"] = df.AVERAGEPRICE * df.XLARGE_BAGS
df.head()

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva
DATE,,,,,,,,,,
2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,0.0
2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,0.0
2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany,0.0
2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany,0.0
2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany,0.0

In [245]:
df["resta"] = df["TOTAL_VOLUME"] - df["TOTAL_BAGS"]
df.head()

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva,resta
DATE,,,,,,,,,,,
2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,0.0,73180.99
2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,0.0,44855.65
2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany,0.0,49295.87
2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany,0.0,75134.90
2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany,0.0,102599.11

##ㅁpply !!

Aplica una funci칩n a lo largo de un eje del DataFrame.      
[Lee la doc](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

In [246]:
#Creamos una funci칩n sencilla que vamos a aplicar
def devuelve_entero(x):
    return int(x)

In [247]:
devuelve_entero(3.4)

3

In [248]:
# Aplicamos la funci칩n a una columna y vemos el resultado en la salida
df["resta"].apply(devuelve_entero)

DATE
2015-12-06     73180
2015-11-29     44855
2015-11-22     49295
2015-11-15     75134
2015-11-08    102599
               ...
2018-02-04      3576
2018-01-28      4623
2018-01-21      4372
2018-01-14      5235
2018-01-07      5475
Name: resta, Length: 18246, dtype: int64

In [249]:
# Vamos a crear una columna nueva haciendo un apply a otra columna
df["nueva"] = df["resta"].apply(devuelve_entero)

In [250]:
df.head()

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva,resta
DATE,,,,,,,,,,,
2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,73180,73180.99
2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,44855,44855.65
2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany,49295,49295.87
2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany,75134,75134.90
2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany,102599,102599.11

In [251]:
#Hazlo con lambda!!
df["completo"] = df.apply(lambda row: f"{row['YEAR']} {row['REGION']}", axis = 1)
df.head()

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva,resta,completo
DATE,,,,,,,,,,,,
2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,73180,73180.99,2015 Albany
2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,44855,44855.65,2015 Albany
2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany,49295,49295.87,2015 Albany
2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany,75134,75134.90,2015 Albany
2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany,102599,102599.11,2015 Albany

##Df .loc e .iloc

### Seleccionar filas y columnas en Pandas mediante posici칩n con iloc

El m칠todo iloc se utiliza en los DataFrames para seleccionar los elementos en base a su ubicaci칩n. Su sintaxis es data.iloc[<filas>, <columnas>], donde <filas> y <columnas> son la posici칩n de las filas y columnas que se desean seleccionar en el orden que aparecen en el objeto. Una notaci칩n familiar para los usuarios de Matlab. En un DataFrame cada una de las filas tiene un n칰mero que va desde 0 hasta el total de filas menos uno. Siendo iloc el m칠todo que permite seleccionar los datos en base a estos n칰meros. Lo mismo que aplica a las columnas.

En iloc hay dos argumentos filas y columnas. En caso de que se omita el segundo, se seleccionar치n todas las columnas de la fila. As칤 para seleccionar diferentes filas se puede utilizar.

In [121]:
#seleccionamos un registro completo
df.iloc[0]

DATE              2015-12-06
AVERAGEPRICE            1.08
TOTAL_VOLUME        78992.15
TOTAL_BAGS           5811.16
SMALL_BAGS            5677.4
LARGE_BAGS            133.76
XLARGE_BAGS              0.0
TYPE            conventional
YEAR                    2015
REGION                Albany
nueva                  73180
resta               73180.99
completo         2015 Albany
Name: 0, dtype: object

In [122]:
#un rango de registros con sliding
df.iloc[6:15]

,DATE,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva,resta,completo
6,2015-10-25,1.07,74338.76,8625.92,8061.47,564.45,0.0,conventional,2015,Albany,65712,65712.84,2015 Albany
7,2015-10-18,1.12,84843.44,8205.66,7877.86,327.80,0.0,conventional,2015,Albany,76637,76637.78,2015 Albany
8,2015-10-11,1.28,64489.17,10123.90,9866.27,257.63,0.0,conventional,2015,Albany,54365,54365.27,2015 Albany
9,2015-10-04,1.31,61007.10,8756.75,8379.98,376.77,0.0,conventional,2015,Albany,52250,52250.35,2015 Albany
10,2015-09-27,0.99,106803.39,6034.46,5888.87,145.59,0.0,conventional,2015,Albany,100768,100768.93,2015 Albany
11,2015-09-20,1.33,69759.01,9267.36,8489.10,778.26,0.0,conventional,2015,Albany,60491,60491.65,2015 Albany
12,2015-09-13,1.28,76111.27,9286.68,8665.19,621.49,0.0,conventional,2015,Albany,66824,66824.59,2015 Albany
13,2015-09-06,1.11,99172.96,7990.10,7762.87,227.23,0.0,conventional,2015,Albany,91182,91182.86,2015 Albany
14,2015-08-30,1.07,105693.84,10306.73,10218.93,87.80,0.0,conventional,2015,Albany,95387,95387.11,2015 Albany

In [132]:
df.AVERAGEPRICE[0:2]

0    1.08
1    1.28
Name: AVERAGEPRICE, dtype: float64

In [ ]:
# Registros de la primera columna

In [134]:
df.iloc[:3,[0]]

         DATE
0  2015-12-06
1  2015-11-29
2  2015-11-22

### Seleccionar filas y columnas en Pandas en base a etiquetas con loc
El m칠todo loc se puede usar de dos formas diferentes: seleccionar filas o columnas en base a una etiqueta o seleccionar filas o columnas en base a una condici칩n.

#### En base a etiqueta

In [140]:
df.loc["2015-12-06"]

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva,resta,completo
DATE,,,,,,,,,,,,
2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.00,conventional,2015,Albany,73180,73180.99,2015 Albany
2015-12-06,1.07,357636.82,50690.04,37032.67,13654.66,2.71,conventional,2015,Atlanta,306946,306946.78,2015 Atlanta
2015-12-06,1.04,649141.25,118664.97,117112.77,1552.20,0.00,conventional,2015,BaltimoreWashington,530476,530476.28,2015 BaltimoreWashington
2015-12-06,0.71,95295.34,43091.60,42734.53,0.00,357.07,conventional,2015,Boise,52203,52203.74,2015 Boise
2015-12-06,1.02,488679.31,75889.78,75666.22,223.56,0.00,conventional,2015,Boston,412789,412789.53,2015 Boston
...,...,...,...,...,...,...,...,...,...,...,...,...
2015-12-06,2.12,2339.64,127.93,24.55,103.38,0.00,organic,2015,StLouis,2211,2211.71,2015 StLouis
2015-12-06,1.56,1803.00,1748.97,1738.06,10.91,0.00,organic,2015,Syracuse,54,54.03,2015 Syracuse
2015-12-06,1.76,1739.62,803.33,803.33,0.00,0.00,organic,2015,Tampa,936,936.29,2015 Tampa
2015-12-06,1.52,514112.96,207260.92,108684.49,98576.43,0.00,organic,2015,TotalUS,306852,306852.04,2015 TotalUS
2015-12-06,1.39,139927.17,67949.89,3623.32,64326.57,0.00,organic,2015,West,71977,71977.28,2015 West

####En base a una condici칩n
Quiz치s esta sea una de las opciones m치s interesantes de las vistas, ya que permite seleccionar los datos en un DataFrame en base condiciones l칩gicas. Las cuales se pueden obtener a partir de los valores

In [141]:
is_2015 = df.loc[:, "YEAR"] == 2015
df_loc = df.loc[is_2015]
df_loc

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva,resta,completo
DATE,,,,,,,,,,,,
2015-12-06,1.08,78992.15,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,73180,73180.99,2015 Albany
2015-11-29,1.28,51039.60,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,44855,44855.65,2015 Albany
2015-11-22,1.26,55979.78,6683.91,6556.47,127.44,0.0,conventional,2015,Albany,49295,49295.87,2015 Albany
2015-11-15,0.99,83453.76,8318.86,8196.81,122.05,0.0,conventional,2015,Albany,75134,75134.90,2015 Albany
2015-11-08,0.98,109428.33,6829.22,6266.85,562.37,0.0,conventional,2015,Albany,102599,102599.11,2015 Albany
...,...,...,...,...,...,...,...,...,...,...,...,...
2015-02-01,1.77,7210.19,2563.33,2563.33,0.00,0.0,organic,2015,WestTexNewMexico,4646,4646.86,2015 WestTexNewMexico
2015-01-25,1.63,7324.06,2356.88,2320.00,36.88,0.0,organic,2015,WestTexNewMexico,4967,4967.18,2015 WestTexNewMexico
2015-01-18,1.71,5508.20,1635.84,1620.00,15.84,0.0,organic,2015,WestTexNewMexico,3872,3872.36,2015 WestTexNewMexico
2015-01-11,1.69,6861.73,2661.91,2656.66,5.25,0.0,organic,2015,WestTexNewMexico,4199,4199.82,2015 WestTexNewMexico
2015-01-04,1.64,6182.81,1663.34,1663.34,0.00,0.0,organic,2015,WestTexNewMexico,4519,4519.47,2015 WestTexNewMexico

쯈ueremos meterle m치s de una doncidici칩n? let`s go!

In [143]:
filtrado = df.loc[(df["YEAR"] > 2015) & (df["TYPE"] == "organic")]
filtrado

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,TYPE,YEAR,REGION,nueva,resta,completo
DATE,,,,,,,,,,,,
2016-12-25,1.93,1714.92,1387.29,1387.29,0.00,0.0,organic,2016,Albany,327,327.63,2016 Albany
2016-12-18,1.86,1472.84,1163.43,1163.43,0.00,0.0,organic,2016,Albany,309,309.41,2016 Albany
2016-12-11,1.90,1886.63,1687.65,1687.65,0.00,0.0,organic,2016,Albany,198,198.98,2016 Albany
2016-12-04,1.97,1364.73,1165.55,1165.55,0.00,0.0,organic,2016,Albany,199,199.18,2016 Albany
2016-11-27,1.97,1646.78,1418.94,1418.94,0.00,0.0,organic,2016,Albany,227,227.84,2016 Albany
...,...,...,...,...,...,...,...,...,...,...,...,...
2018-02-04,1.63,17074.83,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico,3576,3576.16,2018 WestTexNewMexico
2018-01-28,1.71,13888.04,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico,4623,4623.20,2018 WestTexNewMexico
2018-01-21,1.87,13766.76,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico,4372,4372.65,2018 WestTexNewMexico
2018-01-14,1.93,16205.22,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico,5235,5235.68,2018 WestTexNewMexico
2018-01-07,1.62,17489.58,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico,5475,5475.43,2018 WestTexNewMexico

Sintaxis del loc con varias condiciones
```python 
df.loc[(df["columna"] condici칩n) & (df["columna"] condici칩n)]
````

Misma operaci칩n, pero dame solo columnas concretas

In [144]:
filtrado2 = df.loc[(df["YEAR"] > 2015) & (df["TYPE"] == "organic"), ["AVERAGEPRICE", "YEAR", "REGION"]]
filtrado2

            AVERAGEPRICE  YEAR            REGION
DATE
2016-12-25          1.93  2016            Albany
2016-12-18          1.86  2016            Albany
2016-12-11          1.90  2016            Albany
2016-12-04          1.97  2016            Albany
2016-11-27          1.97  2016            Albany
...                  ...   ...               ...
2018-02-04          1.63  2018  WestTexNewMexico
2018-01-28          1.71  2018  WestTexNewMexico
2018-01-21          1.87  2018  WestTexNewMexico
2018-01-14          1.93  2018  WestTexNewMexico
2018-01-07          1.62  2018  WestTexNewMexico

[6316 rows x 3 columns]

##ㅁn치lisis exploratorio de un dataframe

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18246 entries, 0 to 18245
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   DATE          18246 non-null  object
 1   AVERAGEPRICE  18246 non-null  float64
 2   TOTAL_VOLUME  18246 non-null  float64
 3   TOTAL_BAGS    18246 non-null  float64
 4   SMALL_BAGS    18246 non-null  float64
 5   LARGE_BAGS    18246 non-null  float64
 6   XLARGE_BAGS   18246 non-null  float64
 7   TYPE          18246 non-null  object
 8   YEAR          18246 non-null  int64
 9   REGION        18246 non-null  object
 10  nueva         18246 non-null  float64
 11  resta         18246 non-null  float64
dtypes: float64(8), int64(1), object(3)
memory usage: 1.7+ MB

In [103]:
df.shape

(18246, 12)

In [105]:
df.describe()

,AVERAGEPRICE,TOTAL_VOLUME,TOTAL_BAGS,SMALL_BAGS,LARGE_BAGS,XLARGE_BAGS,YEAR,nueva,resta
count,18246.000000,1.824600e+04,1.824600e+04,1.824600e+04,1.824600e+04,18246.000000,18246.000000,18246.000000,1.824600e+04
mean,1.406012,8.507709e+05,2.396772e+05,1.822232e+05,5.434701e+04,3106.937265,2016.148087,3530.411734,6.110937e+05
std,0.402694,3.453815e+06,9.863190e+05,7.462365e+05,2.439850e+05,17694.304357,0.939900,20212.601239,2.517996e+06
min,0.440000,8.456000e+01,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,2015.000000,0.000000,2.000000e+00
25%,1.100000,1.083647e+04,5.084710e+03,2.847965e+03,1.280175e+02,0.000000,2015.000000,0.000000,4.969667e+03
50%,1.370000,1.074040e+05,3.976482e+04,2.637781e+04,2.649285e+03,0.000000,2016.000000,0.000000,5.820127e+04
75%,1.660000,4.331048e+05,1.107878e+05,8.333783e+04,2.203605e+04,133.002500,2017.000000,152.043000,3.078713e+05
max,3.250000,6.250565e+07,1.937313e+07,1.338459e+07,5.719097e+06,551693.650000,2018.000000,584795.269000,4.473616e+07

In [108]:
df.AVERAGEPRICE.min()

0.44

In [109]:
df.AVERAGEPRICE.max()

3.25

In [110]:
df.AVERAGEPRICE.sum()

25654.089999999997

In [111]:
df.YEAR.value_counts()

2017    5722
2016    5616
2015    5612
2018    1296
Name: YEAR, dtype: int64

In [112]:
df.dtypes

DATE             object
AVERAGEPRICE    float64
TOTAL_VOLUME    float64
TOTAL_BAGS      float64
SMALL_BAGS      float64
LARGE_BAGS      float64
XLARGE_BAGS     float64
TYPE             object
YEAR              int64
REGION           object
nueva           float64
resta           float64
dtype: object

### Buscamos valores nulos

In [145]:
import seaborn as sns

In [168]:
df_titanic = sns.load_dataset("titanic")

In [169]:
df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [148]:
df_titanic.shape

(891, 15)

In [154]:
df_titanic.isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [151]:
df_titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [153]:
# Usemos sort values de las series para ordenar los valores y verlo m치s claramente
df_titanic.isnull().sum().sort_values(ascending= False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

###Borramos los valores nulos
Hay varias formas de hacerlo, tenemos en cuenta el par치metro "how" y, desde luego, [nos leemos la documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

In [156]:
#Con "all" borramos donde TODOS los registros sean NaN
df_titanic.dropna(axis = 0, how="all")
df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Con "any" (par치metro que viene by default as칤 que ojo con no poner nada) se borran todos los registros en los que en alguna columna haya un NaN

In [157]:
df_titanic.shape

(891, 15)

In [167]:
df_titanic.dropna(axis = 0, how = "any", inplace= True)

In [160]:
df_titanic.shape

(182, 15)

In [170]:
# Si pongo axis 1 trabajo con columnas, por tanto, me cargar칠 aquellas columnas que tengan un solo NaN
df_titanic.dropna(axis = 1, how = "any", inplace= True)

In [171]:
df_titanic.head()

,survived,pclass,sex,sibsp,parch,fare,class,who,adult_male,alive,alone
0,0,3,male,1,0,7.2500,Third,man,True,no,False
1,1,1,female,1,0,71.2833,First,woman,False,yes,False
2,1,3,female,0,0,7.9250,Third,woman,False,yes,True
3,1,1,female,1,0,53.1000,First,woman,False,yes,False
4,0,3,male,0,0,8.0500,Third,man,True,no,True

### C칩mo rellenar los datos que faltan

쯈u칠 os parece un poquito de [documentaci칩n](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

In [172]:
df = sns.load_dataset("titanic")

In [173]:
df.age.fillna(0)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [176]:
df.age.fillna(int(df.age.mean()))

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    29.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

##ㅁgregaci칩n de datos
Un DataFrame puede agruparse en sus filas (eje=0) o en sus columnas (eje=1). Una vez hecho esto, se aplica una funci칩n a cada grupo, produciendo un nuevo valor. Finalmente, los resultados de todas esas aplicaciones de funciones se combinan en un objeto resultado. La forma del objeto resultante depender치 normalmente de lo que se haga con los datos.

In [ ]:
import numpy as np

In [ ]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})

Supongamos que queremos calcular la media de la columna data1 utilizando las etiquetas de key1. Hay varias formas de hacerlo. Una es acceder a datos1 y llamar a groupby con la columna (una Serie) en clave1:

Los datos (una Serie) han sido agregados seg칰n la clave de grupo, produciendo una nueva Serie que ahora est치 indexada por los valores 칰nicos de la columna clave1. El 칤ndice resultante tiene el nombre 'clave1' porque la columna DataFrame df['clave1'] lo hizo.    
Si en su lugar hubi칠ramos pasado m칰ltiples arrays como una lista, obtendr칤amos algo diferente:

Otra forma de groupby con sintaxis agg

In [257]:
###Regalo merge / concat

In [177]:
df_occupations = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')

In [179]:
dfo = df_occupations.copy()
dfo.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [ ]:
# Concat

In [255]:
#Merge
df_occupations_1 = df_occupations[['age', 'gender']].reset_index()
df_occupations_2 = df_occupations[['occupation', 'gender', 'zip_code']].reset_index()

쯇odemos recuperar el archivo original? 춰Yaaaaass, `merge` al rescate!
[Lee la documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html)

##Spoiler fantasioso de ma침ana

In [ ]:
import plotly

## Summaary

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)
* [Materials by a friend of a friend Juan Huguet](https://github.com/juanhuguetgarcia/uib-aa-g1-material/tree/master/W1%20-%20Intro%20to%20python%20y%20pandas)